

def make_timetable(a_time: list, b_time: list, c_time: list, d_time: list):

    mon_pos = {'10시': [], '11시': [], '12시': [], '13시': [], '14시': [], '15시': [], '16시': [], '17시': []}
    tue_pos = {'10시': [], '11시': [], '12시': [], '13시': [], '14시': [], '15시': [], '16시': [], '17시': []}
    wed_pos = {'10시': [], '11시': [], '12시': [], '13시': [], '14시': [], '15시': [], '16시': [], '17시': []}
    thu_pos = {'10시': [], '11시': [], '12시': [], '13시': [], '14시': [], '15시': [], '16시': [], '17시': []}
    fri_pos = {'10시': [], '11시': [], '12시': [], '13시': [], '14시': [], '15시': [], '16시': [], '17시': []}

    mon = {'a': [], 'b': [], 'c': [], 'd': []}
    tue = {'a': [], 'b': [], 'c': [], 'd': []}
    wed = {'a': [], 'b': [], 'c': [], 'd': []}
    thu = {'a': [], 'b': [], 'c': [], 'd': []}
    fri = {'a': [], 'b': [], 'c': [], 'd': []}

    for count in range(0, 5):
        a_times = a_time[count]
        days = []
        if ';' in a_times:
            for counts in range(0, len(a_times.split(';'))):
                time = a_times.split(';')[counts].split('~')
                length = range(int(time[0][0:2]), int(time[1][0:2]))
                for i in length:
                    days.append(i)
        else:
            a_times = a_times.split('~')
            length = range(int(a_times[0][0:2]), int(a_times[1][0:2]))
            for i in length:
                days.append(i)
        for day in days:
            if count == 0:
                mon_pos['%d시' % day] = ['a']

    print(mon_pos)

a = ['10:00~14:00', '15:00~18:00', '11:00~13:00;14:00~16:00', '10:00~11:00', '15:00~18:00']
b = ['11:00~14:00', '14:00~16:00', '16:00~18:00', '10:00~11:00;12:00~13:00', '14:00~16:00']
c = ['14:00~16:00', '16:00~18:00', '10:00~12:00', '12:00~14:00', '14:00~16:00']
d = ['14:00~18:00', '10:00~18:00', '12:00~14:00', '14:00~15:00;16:00~17:00', '10:00~12:00']
make_timetable(a, b, c, d)
